{
    "hero_title": "Messenger anonimo BeProg",
    "hero_text": "Ora puoi comunicare in modo anonimo, senza numero di telefono o registrazione.",
    "hero_block": "Non sono richiesti né numero di telefono né registrazione.",
    "hero_title_second": "Per chattare con qualcuno, è sufficiente una <span class=\"password-img\"><img src=\"assets/images/password-img.svg\" alt=\"\"></span> password.",
    "hero_list_first": "Tutte le chat sono protette dalla crittografia <span>simmetrica “one-time pad”</span>, dove ogni messaggio viene crittografato con una nuova chiave che non si ripete mai.",
    "hero_list_second": "<span>Per telefonare</span>, usa la password, non il numero di telefono.",
    "how_title": "Come funziona in pratica:",
    "about_title": "BeProg è un'app di comunicazione completamente anonima",
    "about_subtitle": "Chiamate vocali e messaggi sicuri facili da usare",
    "about_card_title_first": "Non richiede il numero di telefono",
    "about_card_text_first": "Invece di scambiarsi i numeri di telefono, ci si scambia le password.",
    "about_card_title_second": "Password",
    "about_card_text_second": "Imposta una password, condividila con il tuo interlocutore e crea una chat privata per entrambi.",
    "about_card_title_third": "Crea un canale",
    "about_card_text_third": "Pubblica messaggi protetti per un pubblico illimitato",
    "about_card_title_fourth": "Senza spam e senza pubblicità",
    "about_card_text_fourth": "BeProg è un'app senza pubblicità e senza spam",
    "banner_text": "L'app BeProg ti darà quella <img src='assets/images/icons/like-in-text.svg' alt=''> tranquillità che solo l'anonimato può garantire.",
    "nav_link_first": "Informazioni sull'app",
    "nav_link_second": "Come funziona",
    "nav_link_third": "Vantaggi",
    "nav_link_fourth": "Descrizione",
    "anonymity_title": "Anonimato",
    "anonymity_text": "Abbiamo puntato sui massimi livelli di anonimato, ma allo stesso tempo l’app è facilissima da usare. L'app non richiede alcuna identificazione, numero di telefono o ID del dispositivo. L'app non richiede l'autorizzazione di altre applicazioni dell'utente come: Contatti, Posizione, Rubrica telefonica, ecc.",
    "simplicity_title": "Semplicità",
    "simplicity_text": "L'app ha un set minimo di funzioni intuitive. La creazione di una chat è molto semplice e avviene in due fasi. Abbiamo sviluppato un'applicazione facilissima da usare.",
    "possibilities_title": "Possibilità",
    "possibilities_text": "Crea canali anonimi per un numero illimitato di iscritti.",
    "safety_title": "Sicurezza",
    "safety_text": "Utilizziamo il nostro metodo proprietario basato sulla crittografia simmetrica end-to-end con il principio del one-time pad.",
    "download_text": "Scaricamento",
    "how_card_first": "Aprire l'app, premere <img class='img-small' src='assets/images/icons/plus-text.svg' alt=''> nella parte bassa dello schermo",
    "how_card_second": "Scegliere «Chat privata»",
    "how_card_third": "Digitare la password e il nome della chat",
    "how_card_fourth": "Premere «Avanti», ed è fatta!",
    "how_card_text": "Aspettare finché l’altro utente faccia lo stesso, e ora potete <img src='assets/images/icons/how-icon.svg' alt=''> comunicare!",
    "qr_title": "Codice QR per scaricare BeProg",
    "qr_step_first": "Attiva la fotocamera",
    "qr_step_second": "Scansiona il codice QR e segui il link"
}