{
    "hero_title": "Messager anonyme BeProg",
    "hero_text": "Communiquez de manière anonyme sans numéro de téléphone ni inscription.",
    "hero_block": "Aucun numéro de téléphone ni inscription n'est nécessaire",
    "hero_title_second": "Pour tchatter avec quelqu'un, il suffit d'un mot de <span class='password-img'><img src='assets/images/password-img.svg' alt=''></span> passe.",
    "hero_list_first": "Tous les tchats sont protégés par un cryptage <span>symétrique « one-time pad »</span>, c'est-à-dire que chaque message est crypté à l'aide d'une nouvelle clé qui ne se répète jamais.",
    "hero_list_second": "Pour <span>passer des appels</span>, utilisez un mot de passe et non votre numéro de téléphone.",
    "how_title": "Comment cela fonctionne-t-il dans la pratique ?",
    "about_title": "BeProg est une application de communication totalement anonyme",
    "about_subtitle": "Appels et messages vocaux sécurisés faciles à utiliser",
    "about_card_title_first": "Le numéro de téléphone <br> n'est pas nécessaire",
    "about_card_text_first": "Au lieu d'échanger des numéros de téléphone, échangez des mots de passe.",
    "about_card_title_second": "Mot de passe",
    "about_card_text_second": "Trouvez un mot de passe, partagez-le avec l'autre personne et créez un tchat privé pour vous deux.",
    "about_card_title_third": "Créez un canal",
    "about_card_text_third": "Publiez des messages protégés pour un public illimité",
    "about_card_title_fourth": "Sans spam et sans publicité",
    "about_card_text_fourth": "L'application BeProg est sans publicité et sans spam",
    "banner_text": "L'application BeProg vous apportera la tranquillité d'esprit que seul l'anonymat <img src='assets/images/icons/like-in-text.svg' alt=''> peut procurer.",
    "nav_link_first": "À propos de l'application",
    "nav_link_second": "Comment ça fonctionne",
    "nav_link_third": "Les avantages",
    "nav_link_fourth": "Description",
    "anonymity_title": "Anonymat",
    "anonymity_text": "Nous avons cherché à atteindre les plus hauts niveaux d'anonymat, tout en restant une application très facile à utiliser. L'application ne nécessite pas d'identification, de numéro de téléphone ou ID d'appareil. L'application ne demande pas la permission à d'autres applications de l'utilisateur telles que : Contacts, Localisation, Téléphone, etc.",
    "simplicity_title": "Simplicité",
    "simplicity_text": "L'application dispose d'un ensemble minimal de fonctions intuitives. La création d'un tchat est simple et se fait en deux étapes. Nous avons développé une application facile à utiliser.",
    "possibilities_title": "Possibilités",
    "possibilities_text": "Créez des canaux anonymes pour un nombre illimité d'abonnés.",
    "safety_title": "Sécurité",
    "safety_text": "Nous utilisons notre propre méthode basée sur le cryptage symétrique end-to-end combiné au principe du one-time pad.",
    "download_text": "Télécharger",
    "how_card_first": "Ouvrez l'application, appuyez sur <img class='img-small' src='assets/images/icons/plus-text.svg' alt=''> en bas de l'écran",
    "how_card_second": "Choisissez «Tchat privé»",
    "how_card_third": "Saisissez votre mot de passe et votre nom de chat",
    "how_card_fourth": "Appuyez sur «Suivant», et vous avez terminé!",
    "how_card_text": "Attendez que l'autre utilisateur fasse de même, et vous pouvez maintenant <img src='assets/images/icons/how-icon.svg' alt=''> communiquer!",
    "qr_title": "Code QR pour télécharger BeProg",
    "qr_step_first": "Activez la caméra",
    "qr_step_second": "Scannez le code QR et suivez le lien"
}