const popupContentObject = [
    {
        name: 'music',
        items: [
            {
                title: '«Orchestral Set No. 2. Ч.3 From Hanover Square North, At the End of a Tragic Day, The Voice of the People Again Arose»',
                subtitle: 'Charles Ives, Michael Tilson Thomas',
                text: 'Реквием по случайным жертвам военных конфликтов.',
                quote: {
                    name: 'Денис Бояринов:',
                    text: '«Это сочинение американского визионера связано с конкретной датой: 7 мая 1915, когда пришло известие о том, что британский трансатлантический лайнер «Лузитания» был потоплен немецкой подлодкой. Погибли без малого две тысячи человек, среди них десятки детей. Сложно поверить, что эта музыка, звучащая как сюрреалистический реквием по случайным жертвам всех военных конфликтов, была создана в 1910-е»',
                }
            },
            {
                title: "«Oh Lord Don't Let Them Drop That Atomic Bomb On Me»",
                subtitle: 'Чарльз Мингус ',
                text: 'Ироническая композиция про боязнь ядерной войны',
                quote: {
                    name: 'Николай Овчинников:',
                    text: "«Один из революционеров пост-бопа, басист, бэндлидер и композитор Чарльз Мингус был человеком с активной гражданской позицией. Незадолго до Карибского кризиса он разрядил предчувствие ядерной войны в ироническом блюзе «Oh Lord Don't Let Them Drop That Atomic Bomb On Me», где еще и спел»",
                }
            },
            {
                title: '«Shipbuilding»',
                subtitle: 'Роберт Уайатт',
                text: 'Пронзительная песня про эхо войны',
                quote: {
                    name: 'Денис Бояринов:',
                    text: '«Песня, сочиненная Элвисом Костелло по следам Фолклендской войны между Великобританией и Аргентиной, была гениально исполнена Робертом Уайаттом. Она о том, что война — это не только смерть и разрушения, но и «гробовые деньги». Но стоят ли они того?»',
                }
            },
            {
                title: '«Обійми»',
                subtitle: 'Святослав Вакарчук и Роберт Дель Найя',
                text: 'Ремейк одной из лучших песен «Океана Ельзи» в дуэте с создателем Massive Attack',
                quote: {
                    name: 'Денис Бояринов:',
                    text: '«Океан Ельзи» выпустили «Обійми» в 2013-м — еще до аннексии Крыма и начала войны в Донбассе. В марте 2022-го участник британской группы Massive Attack Роберт Дель Ная (он же 3D) сделал ремикс этой композиции. Все доходы от ее продаж идут международному благотворительному фонду Legacy of War, помогающему мирным жителям, пострадавшим в военных действиях',
                }
            },
            {
                title: '«The Man on Your Street»',
                subtitle: 'The Happy Family',
                text: 'Невероятно оптимистичный постпанк/экспериментальный рок о любви во время войны и диктатуры. ',
                quote: {
                    name: '0.0:',
                    text: 'За всей тонкостью аранжировок и восторгом слова у The Happy Family крылся не только эмоциональный надрыв, но и инструкция по выживанию, что делать молодым, красивым и влюбленным на чужих берегах и среди других людей. Смотреть по сторонам, научиться жить, и доверять только самим себе — и не потому что вокруг полно агентов его величества, а просто все остальные и так сволочи.',
                }
            },
            {
                title: '«Mercenary»',
                subtitle: 'Bolt Thrower',
                text: 'Мощный и лихой метал о войне изнутри',
                quote: {
                    name: '0.0:',
                    text: 'В пику известному выражению «War never changes», английские панк-металлисты Bolt Thrower пели как раз о том, что война постоянно меняется, и совсем не в гуманную сторону. Выходцы из Ковентри успели с размахом пройтись по целому вороху тем. Промышленное уничтожение человекоматериала в обеих мировых, моря крови религиозных войн, нехитрая, но очень грязная солдатская доля и мимолетность памяти о тех, кто своими костями крепит фундамент патриотизма. Сильнейший же альбом BT посвящен профессии одновременно самой романтизируемой и настолько же презираемой — наемника. Его псевдоориентальные мотивы, обернутые пилящими гитарами и насмешливым рыком вокалиста Карла Уиллетса, весьма красочно представляют слушателю, что чувствует любитель путешествовать с винтовкой наперевес, не знающий ничего другого. ',
                }
            },
            {
                title: 'Keane',
                subtitle: '«A Bad Dream»',
                text: 'Гимн бессмысленности войны от британских поп-плакальщиков',
                quote: {
                    name: 'Николай Овчинников:',
                    text: 'Британская группа, намеренно отказавшаяся от гитар в пользу плаксивого рояля, запомнилась большинству своими интроспективными песнями о метущейся душе. На втором альбоме «Under the Iron Sea» они показали, что могут петь и о вещах глобальных без пафоса и пошлости. Лучшее — это композиция «A Bad Dream». Пронзительная баллада написана по мотивам стихотворения Уильяма Йетса «Ирландский летчик предвидит свою смерть»: его герой вынужден воевать, но сам не понимает, ради чего. Ведь «тех, с кем я борюсь, я не ненавижу, а тех, кого я должен охранять, я не люблю». «A Bad Dream» вышла, когда все возмущались американской «спецоперацией» в Ираке, но и сейчас звучит максимально злободневно. ',
                }
            },
            {
                title: 'Agents with False Memories',
                subtitle: '«Agents with False Memories»',
                quote: {
                    name: '0.0:',
                    text: 'Беды с башкой получают отнюдь не только непосредственные участники боевых действий — кукуха так-то шатается у всех причастных вплоть до высшего командования. Этот одноразовый проект Ричарда Керка из Cabaret Voltaire был задуман как раз с такой целью — показать, что происходит в башке всех тех, кто принимает участие в боевых действиях не лично, но принимает на себя весь груз ответственности. Запись, полная паранойи и недоверия — такого, что больше одного прослушивания этого диска отражаются уже и на слушателе.',
                }
            },
            {
                title: '«Свой дом»',
                subtitle: 'Макс Корж',
                text: 'Главный беларуский исполнитель — о том, кто прав',
                quote: {
                    name: 'Артем Кольцов:',
                    text: 'Безапелляционно ключевая песня на тему войны в Украине на русском языке была записана обладателем беларусского паспорта. Заодно Макс буквально в одно предложение уложил всю суть своего отношения к происходящему: «Прав тот, кто защищает свой дом». А без кома в горле слушать её не получается и спустя почти два года после начала войны.',
                }
            },
            {
                title: '«12»',
                subtitle: 'Моргенштерн',
                text: 'Рэп-пересмешник на несколько минут снимает маску шута и говорит о смерти. Слушать до конца',
                quote: {
                    name: 'Артем Кольцов:',
                    text: 'Да, именно Алишер Тагирович Моргенштерн. Здесь важен контекст: клип на песню «12» вышел 14 марта 2022 года, когда большинство артистов ещё только разбирались в том, как спроецировать боль и страх от происходящего в музыку. У Моргена же получилось быстро оттранслировать ощущение от «дядь, которые отправят на бойню» в трек, выпущенный к 12-летию младшего брата. За которого он радуется: «Как хорошо, что он рос не в России, его не учили бояться». Клип заканчивается войсом, который битмейкеру трека Палагину прислала мама из Украины: о том, как прошёл очередной день бомбежек. Кажется, есть какой-то грустный символизм в том, что один из первых антивоенных треков записал главный артист-клоун современной России.',
                }
            },
        ],
    },
    {
        name: 'movie',
        items: [
            {
                title: '«Великая иллюзия»',
                subtitle: 'Жан Ренуар 1937',
                quote: {
                    text: '«Великая иллюзия» перед началом Первой мировой – что война невыгодна никому, и потому ее не должно случиться. «Великая иллюзия» перед началом Второй – что ужас Первой был настолько убедителен, и потому это никогда не повторится. А что за иллюзия у нас сегодня? ',
                }
            },
            {
                title: "«Апокалипсис сегодня»",
                subtitle: 'Френсис Форд Коппола 1979',
                text: 'Один из главных фильмов про войну во Вьетнаме. The Doors, запах напалма по утрам и безумный взгляд Марлона Брандо. Классика навсегда.',
                quote: {
                    name: 'Антон Долин:',
                    text: 'Из внушительного списка американских фильмов о войне во Вьетнаме этот - самый дикий, странный, неформатный во всех смыслах, почему-то основанный на "Сердце тьмы" Конрада - великом, но отнюдь не очевидном тексте о совсем других событиях. Коппола, достигший вершины мастерства в двух "Крестных отцах" и "Разговоре", в "Апокалипсисе сегодня" неожиданно подпрыгнул выше головы и пробил потолок, оказавшись в безвоздушном пространстве: там, где важен не исторический или политический контекст, а чистая экзистенция власти и смерти, неожиданно оказавшихся одной и той же непостижимой и завораживающей субстанцией.',
                }
            },
            {
                title: '«Дьяволы у порога»',
                subtitle: 'Цзян Вэнь 2000',
                text: 'У подножия Великой Китайской стены крестьяне переживают японскую оккупацию. «Банальность зла» в Азии – напоминание, почему Вторая Мировая война действительно называется Мировой.  ',
                quote: {
                    name: 'Антон Долин:',
                    text: 'О том, что во Вторую Мировую погибали многие народы, а китайцы принесли самую чудовищную жертву - по меньшей мере, количественно - в Европе и Штатах вспоминать не любят. Не хватает ни информации, ни эмпатии. Этот фильм, получивший каннский Гран-при, способен восстановить баланс хотя бы отчасти. Потрясающий актер Цзян Вэнь, которого прославил "Красный гаолян" Чжана Имоу, оказался незаурядным режиссером, найдя адекватное экранное воплощение для причудливой гротескной притче о военнопленном, переводчике и миролюбивых крестьянах, не желающих становиться заложниками чужой распри. От этого фильма невозможно оторваться, еще труднее его забыть; он страшен и смешон одновременно, а главное - человечен, способен достучаться даже до тех, кто увидит в героях "Дьяволов на пороге" других, чужих. В конечном счете, каждый из нас для кого-то дьявол.'
                }
            },
            {
                title: '«Иди и смотри»',
                subtitle: 'Элем Климов 1985',
                quote: {
                    text: 'Один из самых страшных фильмов в истории. Погружение в ад, бесцеремонное к психике и нервам зрителя. Если искусство – зеркало, то в это смотреть не хочется, а нужно',
                }
            },
            {
                title: '«Пожары»',
                subtitle: 'Дени Вильнев 2010',
                text: 'Призраки войны не успокаиваются никогда – некоторые шрамы никогда не зарастают. До того, как прославиться сайфай эпиками, Вильнев уже исследовал природу памяти и жестокости',
                quote: {
                    name: 'Олег Тундра:',
                    text: 'Дени Вильнёв узнал про пьесу «Пожары» случайно: в монреальском театре режиссер попал на постановку канадско-ливанского автора о семье, разлученной во время войны на Ближнем Востоке. Три с половиной часа спектакля вызвали у Вильнёва шок. В своих интервью Вильнёв подчеркивает, что не разбирается в ближневосточных конфликтах и выступает скорее в роли аутсайдера, как и главные герои «Пожаров», всю жизнь прожившие в Канаде. Несмотря на то, что прототипом главной героини была ливанская политзаключенная Суха Бечара, многие события в экранизации вымышлены или преувеличены для драматического эффекта. Драматург главным образом писал о гражданской войне в Ливане, но Вильнёв, работая над экранизацией, решил специально не указывать в фильме конкретную страну, чтобы подчеркнуть универсальность последствий гражданской войны и ее влияния на судьбы женщин. Вильнёва интересует, как идеология замещает личную память и наоборот,. Ничего формально не забывая, главная героиня действительно постепенно утрачивает части своей идентичности: если помнить всё, что ей довелось пережить, не получится сохранить рассудок. Именно поэтому в зонах военных конфликтов исторические и идеологические мифы постоянно чередуются с семейными историями страданий и притеснений, а страны и народы поколениями живут в порочном круге гнева, приспосабливаясь к новым правительствам, границам и режимам.',
                }
            },
            {
                title: '«Шоа»',
                subtitle: 'Клод Ланцман 1985',
                text: 'Фильм – памятник, свидетель, исследователь. Неразрывная связь мировой войны и Холокоста – одно из главный доказательств, что тотальная война априори не может быть благородной и справедливой',
                quote: {
                    name: 'Денис Бояринов:',
                    text: '«Океан Ельзи» выпустили «Обійми» в 2013-м — еще до аннексии Крыма и начала войны в Донбассе. В марте 2022-го участник британской группы Massive Attack Роберт Дель Ная (он же 3D) сделал ремикс этой композиции. Все доходы от ее продаж идут международному благотворительному фонду Legacy of War, помогающему мирным жителям, пострадавшим в военных действиях',
                }
            },
            {
                title: '«Ветер крепчает»',
                subtitle: 'Хаяо Миядзаки 2013',
                quote: {
                    text: 'Живой классик японской анимации сделал картину о том, как возвышенные мечты становятся топливом для диктаторских войн. Дзиро мечтал о полетах и красоте самолетов – а создал в итоге очередную машину смерти',
                }
            },
            {
                title: '«Битва за Алжир»',
                subtitle: 'Джилло Понтекорво 1966',
                quote: {
                    text: 'Режиссер-коммунист снимает о борьбе алжирских повстанцев за независимость. Борьбе успешной. Герои-освободители для одних – террористы для других, так что проиграв в Алжире, французы просто запретили показ картины',
                }
            },
            {
                title: '«Летят журавли»',
                subtitle: 'Михаил Калатозов 1957',
                text: 'Головокружение среди берёз. Классика мирового кино из разряда «Гражданина Кейна» и «Лоуренса Аравийского». Не устарел ни один кадр',
                quote: {
                    name: 'Максим Заговора:',
                    text: 'Возможно искусство и правда переоценено, если общество, которому посчастливилось заглянуть в глаза Татьяны Самойловой на крупном плане Сергея Урусевского, все равно принимает войну. Согласно известному кинокритическому штампу, «Летят журавли» — это первый советский фильм, который показал войну как трагедию тыла, как бытовую драму людей из московских квартир, а не битву измазанных грязью мужчин. Не важно, так ли это на самом деле. Главное — это те самые глаза. Взгляд Самойловой — это взгляд каждой женщины, в каждом доме любого города мира, в который непрошенный гость зашел в военных сапогах. Солдат-захватчик, вспомни этот взгляд, перед тем как заходить в чужой дом. Развернись и иди к себе домой, к своей женщине.'
                }
            },
            {
                title: '«Армия теней»',
                subtitle: 'Жан-Пьер Мельвиль 1969',
                text: 'Сопротивление – героизм без надежды. Франция сдана врагам, немцы под Сталинградом – кажется, нацисты победили, какой смысл продолжать борьбу? Увидите',
                quote: {
                    name: 'Максим Заговора:',
                    text: 'От «Армии теней» становится плохо физически. Каждый кадр — весит больше, чем ты способен унести, каждый диалог в картине совершается под этим давлением, каждое действие — вымученное, каждый выбор — это выбор между плохим и очень плохим. Мельвиль стал Мельвилем, снимая гангстерские драмы, но ведь он никогда не был бандитом, поэтому французский нуар — это нуар романтический. А вот, что из себя представляет война, Мельвиль знал не по книжкам. Он служил в армии, участвовал в Сопротивлении. «Мельвиль» — это ведь его партизанская кличка в честь автора «Моби Дика», которую будущий режиссер взял, чтобы скрыть еврейскую фамилию Грюмбах. И Мельвиль-Грюмбах, закрашивая экран холодными тонами, скупо, без особых разрывов снарядов и грохота бомб (хотя и они тут, конечно, тоже есть) объясняет нам, что война — это тотальная смерть, а не только смерть в бою. Смерть в каждом выборе, который ты совершаешь по несколько раз на дню: бороться или смириться, бежать или остаться. Один из участников Сопротивления отправляет нацистам анонимный донос на себя — пожалуй, главный для меня эпизод во всей картине. Эпизод, который невозможно понять. Ну так и войну понять невозможно. ',
                }
            },
        ],
    },
    {
        name: 'art',
        items: [
            {
                title: '«Розовый танк». 1991',
                subtitle: 'Дэвид Черный',
                text: 'Перекрашенный в розовый символ советского тоталитаризма стал символом свободы',
                quote: {
                    name: 'Марат Гельман:',
                    text: 'История такая: 1991-й год, в Праге этот танк стоял как некое напоминание тому, что если что, то русские снова введут танки и подавят любое свободомыслие, любую попытку уйти из-под власти, влияния Советского союза. Но в Москве уже перестройка, и было непонятно, можно или нельзя. Был такой момент, когда страны Варшавского договора ожидали действительно ли не последует вот этих танков, если они оторвутся от Советского союза. И одной ночью Дэвид Черный покрасил этот танк, символ агрессии в розовый цвет. В первый раз власти его снова перекрасили. Они через 10 дней - по-моему, после майских праздников это было - перекрасили его снова в розовый цвет. И ничего не произошло. То есть его снова не перекрасили, он простоял целый день, художники дают интервью. И на следующий день как бы страна пошла вот в эту последнюю новую Пражскую весну, освободилась. Таким образом, танк стал стартом, знаком того, что власть Советского союза над Восточной Европой закончилась.',
                }
            },
            {
                title: 'Earshot. 2016',
                subtitle: 'Lawrence Abu Hamdan',
                text: 'Иорданский художник работает с неудобным прошлым',
                quote: {
                    name: 'Кирилл Савченков:',
                    text: 'Художестенная практика Лоуренса Абу Хамдана (1985, Иордания) выстраивается вокруг работы со звуком, голосом и слухом, как средств доступа к скрытым проблемам угнетения, военных преступлений и расизма. В данной работе прибегая к детальному акустическому анализу,  Лоуренс Абу Хамдан выводит визуализирует акусическое доказательство использования огнестрельного оружия израильскими солдатами входе столкновений на Западном берегу реки Иордан. Аудио-балестический анализ стал содержанием инсталяции и видео работе посвященной гибели палестинских подростков, судебной практике в Израиле, а так же был включен в расследование череды преступных актов насалия над палестинцами. Это делает данну работу крайне ярким примером исследований художественными способами.',
                }
            },
            {
                title: 'Continuity. 2012',
                subtitle: 'Omer Fast',
                text: 'Фильм как арт-объект: история смерти и ее переживания с нескольких ракурсов',
                quote: {
                    name: 'Кирилл Савченков:',
                    text: 'Фильм родившегося в Израиле художника Омера Фаста, живущего и работающего в Берлине, рассматривает пересечение утраты и горя родителей солдата. История возвращения немецкого солдата из Афганистана в фильме воспроизводится трижды, но с разными актерами исполняющими его роль. Три версии от трех актеров создают непрерывность возвращение солдата домой к родителям, однако художественное воплощение солдата актерами оставляет реального солдата анонимным, так и не вернувшимся. Название работы Непрерывность (Continuity), отсылает к концепции кинопроизводства связанной с созданием ощущения линейности времени из разрозненных кадров. Созданная тремя разными дублями и актерами образ солдата одновременно и непрерывен, и разрознен, таким образом подчеркивается невосполнимость утраты родителями сына, так и не вернувшегося с войны. Возможно зрительницы и зрители фильма видят непрерывное воспоминание родителями призрака сына, через разные версии так и не случившегося возвращения.',
                }
            },
            {
                title: '«Победа»',
                subtitle: 'Шигео Фукуды',
                text: 'Фильм как арт-объект: история смерти и ее переживания с нескольких ракурсов',
                quote: {
                    name: 'Сережа К.:',
                    text: 'Знаменитый антивоенный плакат великого японского плакатиста Шигео Фукуды Victory с пулей не вылетающей, а влетающей в дуло. Невероятной силы плакат, один из величайших за всю историю плакатного искусства.',
                }
            },
            {
                title: '5000 Feet is the Best. 2011',
                subtitle: 'Omer Fast',
                text: 'Омер Фаст показывает жителям США, каково быть оккупированными',
                quote: {
                    name: 'Кирилл Савченков:',
                    text: 'Другая работа Омера Фаста, сделанная на год раньше, чем Continuity реконструирует события войны в Афганистане, однако роли участников радикально переставлены. Нерегулярным партизанским соеденинением становится жители американской деревни, а оккупациоными войсками и операторами дрона солдаты народно-освободительной армии Китая. В фокусе художника оказывается практика применения ударных дронов, преступных ошибок в результате ракетных ударов и пост-травмотических расстройств участниц и участников событий. Сцены изображенные в видеоработе строятся на интервью с бывшим оператором ударного дрона ВВС США и представляют собой документ трасформации войны в упоху удаленного доступа. ',
                }
            },
            {
                title: 'November, 2004',
                subtitle: 'Hito Steyerl',
                text: 'Немецкая художница исследует революцию и утрату',
                quote: {
                    name: 'Кирилл Савченков:',
                    text: 'Ключевая работа для немецкой художницы Хито Штейерль – Ноябрь (November) – посвящена подруге Андреа Вульф, вместе с которой в ранние годы они сняли любительский фильм в ключе популярного кино из 1970х о восточных единоборствах и проблемах социальной справедливости. Андрея в отличии от Хито не стала художницей, но стала ключевой фигурой в курдском освободительном движении. Визуальное эссе сделанное Хито Штейерль расследует роль изображений в революционном движении и момент осознания утраты близкого человека. Андеря Вульф погибла во время ракетного удара турецким ударным вертолетом, что и становится содытием вокруг которого выстраивается художетсвенно работа.',
                }
            },
            {
                title: 'Horse Money, 2014',
                subtitle: 'Pedro Costa',
                text: 'Видео-арт о падении колониализма',
                quote: {
                    name: 'Кирилл Савченков:',
                    text: 'Ключевая работа для немецкой художницы Хито Штейерль – Ноябрь (November) – посвящена подруге Андреа Вульф, вместе с которой в ранние годы они сняли любительский фильм в ключе популярного кино из 1970х о восточных единоборствах и проблемах социальной справедливости. Андрея в отличии от Хито не стала художницей, но стала ключевой фигурой в курдском освободительном движении. Визуальное эссе сделанное Хито Штейерль расследует роль изображений в революционном движении и момент осознания утраты близкого человека. Андеря Вульф погибла во время ракетного удара турецким ударным вертолетом, что и становится содытием вокруг которого выстраивается художетсвенно работа.',
                }
            },
            {
                title: '1395 Days Without Red. 2011',
                subtitle: 'Anri Sala',
                text: 'Прогулка по самому страшному району осажденного Сараево',
                quote: {
                    name: 'Кирилл Савченков:',
                    text: 'Албанский художник Анри Сала (1974) в своей видео работе обратился к одной из самых ужасных моментов в процессе распада Югославии – 1395-дневная осада Сараева, столицы республики Босния и Герцеговина в 1992-96 годах. В фокусе камеры история участницы Сараевского Филармонического Оркестра идущей на работу через простреливаемый город, в том числе через известную Алею Снайперов. Регулярная для любого жителя мирного города прогулка для жительницы Сараево тех военных лет становится прогулкой между жизнью и неожиданной смертью, а для художественной работы зеркалом для коллективной памяти и травмы войны.',
                }
            },
            {
                title: 'House Beautiful: Bringing the War Home, 1967-72',
                subtitle: 'Martha Rosler',
                text: 'Американская художница напоминает гражданам, что их страна ведет кровавую войну на другом конце света',
                quote: {
                    name: 'Кирилл Савченков:',
                    text: 'Практику американской художницы Марты Рослер е возможно вместить в рассмотерние только одной работы. Однако наиболее показтельным становится ее работы с коллажом и фотографией критикующие войну во Вьетнаме с точки не связанности повседневности американских граждан с ведущихся войной. ',
                }
            },
            {
                title: 'активизм. 2023',
                subtitle: 'Александра Сколиченко',
                text: 'Российский активизм как художественное высказывание',
                quote: {
                    name: 'Сережа К.:',
                    text: 'Яркий пример антивоенного активизма, в котором художница Александра Сколиченко стала жертвой селективной репрессии.',
                }
            },
            {
                title: 'Памятник Лесе Украинке и «Древо Жизни» в Иркутске, как новые антивоенные символы',
                quote: {
                    name: 'Ася Зольникова:',
                    text: 'В городском пространстве государства-агрессора не так-то просто высказывать антивоенную позицию через строительство новых капитальных сооружений. Чаще всего используют то, что можно быстро воплотить, например, рисуют граффити или переосмысляют уже существующие монументы. Например, памятник Лесе Украинке в Москве или жертвам политических репрессий в Екатеринбурге. Туда несли цветы в память о тех, кто год назад погиб в Днепре в результате российского ракетного удара по жилому дому. «Древо жизни» в Иркутске в 2023-м тоже превратилось в антивоенный символ — на него вешали ленточки с призывом о мире. '
                }
            },
            {
                title: 'Надпись «Мир» на витрине магазина, как высказывание через городскую среду	',
                quote: {
                    name: 'Ася Зольникова:',
                    text: 'Вообще петербуржцы активнее других высказываются через городскую среду. Там появился еще один антивоенный жанр — витрины, как у петербургского магазина «Все свободны»: они налепили на стекло слово «Мир», однако недавно были вынуждены убрать его из-за давления силовиков (и сами удивлялись, что оно провисело так долго). А летом 2023-го на детской площадке в Муринском парке Петербурга появилась фраза из Евангелия от Матфея «Любите врагов ваших», закодированная в военно-морских флагах.'
                }
            },

            {
                title: 'Каллиграфические эпитафии. 2023',
                subtitle: 'Вита Лопухина',
                quote: {
                    name: 'Сережа К.:',
                    text: 'Вита Лопухина, одна из лучших кириллических каллиграфов, публикует с начала войны каллиграфические эпитации погибшим людям на фойне в Украине. Искусство красивой каллиграфии добавляет пронзительности историям, которые рассказывает Вита и увековечивает их.',
                }
            },
        ],
    },
    {
        name: 'books',
        items: [
            {
                title: '«Цинковые мальчики»',
                subtitle: 'Светлана Алексиевич',
                quote: {
                    text: 'Книга, собранная из свидетельств ветеранов Афгана, их друзей и матерей. Страшное чтение. '
                }
            },
            {
                title: '«Мобилизованная нация: Германия 1939–1945»',
                subtitle: 'Николас Старгардт',
                quote: {
                    text: 'Невыдуманный документ эпохи, наглядно демонстрирующий весь ужас войны в целом и государства-агрессора в частности '
                }
            },
            {
                title: '«Жизнь Льва Толстого. Опыт прочтения» ',
                subtitle: 'Андрей Зорин',
                quote: {
                    text: 'Еще один сильный нон-фикшн, читающийся как полноценное художественное произведение – настолько интересна и удивительна жизнь главного пацифиста российской и мировой литературы. Который, кстати, в начале своего пути был буквально очарован войнами – а после, повзрослев, осознал всю их бессмысленность и лживое уродство'
                }
            },
            {
                title: '«Три совета Будды для современной жизни. Как жить в эпоху перемен»',
                subtitle: 'Пема Чодрон',
                quote: {
                    text: 'Полное любви и тихой гениальности эссе от американской буддистской монахини, явно познавшей суть этой жизни (и в ней точно нет места войне)'
                }
            },
            {
                title: '«SNUFF» ',
                subtitle: 'Виктор Пелевин',
                quote: {
                    text: 'Солнце литературного постмодерна препарирует тему войны в футуристичном сеттинге. Как всегда точно и иронично. И страшно: все мы прямо сейчас движемся в направлении реальности под названием «Война = контент». Хотя кого я обманываю: мы уже в этой реальности…'
                }
            },
            {
                title: '«1984»',
                subtitle: 'Джордж Оруэлл',
                quote: {
                    text: 'Разворачивающаяся прямо на наших глазах без малого великая антиутопия, наглядно демонстрирующая до какого социального ада может довести перманентная война между Евразией и Океанией (да, мы знаем до какого)'
                }
            },
            {
                title: '«Хиросима»',
                subtitle: 'Джон Херси',
                quote: {
                    text: 'Американский корреспондент описывает первые дни после бомбардировки Хиросимы от лица нескольких героев. '
                }
            },
            {
                title: '«Лицо войны»',
                subtitle: 'Марта Геллхорн',
                quote: {
                    text: 'Избранные репортажи из полувековой карьеры американской военной корреспондентки. Маленькая храбрость мирных людей под обстрелами и безумие солдат, скучающих в окопах, — у Геллхорн описана вся повседневность войны.'
                }
            },
            {
                title: '«Голиаф»',
                subtitle: 'Том Голд',
                quote: {
                    text: 'В книге Голда Голиаф — не устрашающий великан, а напуганный призывник, который не понимает, как и зачем попал на войну. Великий комикс о том, как выглядит война, если перестать ее мифологизировать.'
                }
            },
            {
                title: '«Похождения бравого солдата Швейка»',
                subtitle: 'Ярослав Гашек',
                quote: {
                    text: '«Государь император скотина, а войну мы проиграем». '
                }
            },

        ],
    },
    {
        name: 'games',
        items: [
            {
                title: 'Operation Flashpoint/Arma',
                quote: {
                    text: 'Военные симуляторы - это лучшие антивоенные игры. В отличии от аркадных игрулек, каждая твоя смерть в симуляторе - это вполне реальный сценарий гибели, который мог бы случился в реальной боевой ситуации. И именно милсимы показывают лучше всего, что на войне ты будешь убит. Как бы ты не старался, как бы не готовится в учебке, как бы не готовился тактически - один снаряд артиллерии, один дрон, один плохой приказ - и ты перестанешь существовать и твои навыки никак тебя не спасут. Если многие аркадные блокбастеры стараются сделать войну будорожащей и веселой (хотя бы в мультиплеере), то мил-симы показывают её такой, какая она есть.'
                }
            },
            {
                title: 'Spec-Ops: The Line',
                quote: {
                    text: 'Американский солдат отправляется в погребенный под слоем песка Дубай, чтобы спасти оттуда своих товарищей, который застряли в городе во время спасательной миссии. Ты думаешь, что ты ты выживешь, выполнишь задачу, победишь бандитов, станешь героем и вернешься домой. Ты ошибаешься в каждом пункте. Самая сюрреалистичная игра из всего списка.'
                }
            },
            {
                title: 'Вся серия Metal Gear Solid',
                quote: {
                    text: 'И в особенности третья часть 3. Игра об отношении солдата и государства. О том, как наивный воин исполняет приказы, считая каждый из них своим долгом. Государство в солдате действительно нуждается - пока задача не будет выполнена, после чего то же государство неизбежно от него отвернется, в лучшем случае откупившись символическими наградами или статусами. А солдат так и останется наедине со своими потерями и травмами. '
                }
            },
            {
                title: 'Valiant Hearts: The Great War',
                quote: {
                    text: 'История о том, как четыре комбатанта пытаются пройти Первую мировую и при этом остаться людьми, однако удается им это с огромным трудом.'
                }
            },
            {
                title: 'This War of Mine',
                quote: {
                    text: 'Игра о выживании гражданских в условиях боевых действий. О сложных решениях во время поиск провизии, тепла, воды и безопасности в том месте, где цивилизация перестала существовать.'
                }
            },
            {
                title: 'DEFCON',
                quote: {
                    text: 'Если человек по какой-то причине забыл о разрушительной мощи ядерного оружия - стратегия DEFCON ему об этом напомнит. Через простую, примитивную графику она предложит провести общемировой раунд ядерной перестрелки c учетом множества деталей и взглянуть на результаты. Разумеется, тут не выигрывает никто - условным «победителем» считается тот, кто пострадал меньше всех.'
                }
            },
            {
                title: 'Metro',
                quote: {
                    text: 'Серия игр про то, как выжившие после ядерной войны люди всё равно продолжают совершать все же те же ошибки, что привели к этой самой войне. Про то, как страх перед инородным заставляет нас совершать ужасающие вещи - и про то, какие потрясающие вещи мы можем творить, когда перестаем слушать свой страх и начинаем слушать друг друга.'
                }
            },
            {
                title: 'Through the Darkest of Times',
                quote: {
                    text: 'Игра про сопротивление нацистскому режиму во время войны. Ты знаешь, что проиграешь, но продолжаешь бороться. Сокрушительной силы игра.'
                }
            },
            {
                title: '11-11 Memories Retold',
                quote: {
                    text: 'Очень красивая адвенчура о Первой мировой. О поиске родного человека — и трагедии вокруг.'
                }
            },
            {
                title: 'Fallout',
                quote: {
                    text: 'Со временем этого становится меньше, но вообще серия изначально поднимала довольно интересные философские вопросы о конфликтах, ну и постоянно тебе напоминала о войне, которая привела мир к апокалипсису.'
                }
            },
            {
                title: 'Disco Elysium',
                quote: {
                    text: 'Там вроде бы довольно мало про войну, но действие происходит в городе, страдающем от её последствий, плюс всё в итоге (спойлер) может закончиться ядерным ударом.'
                }
            },
            {
                title: 'The Feast',
                quote: {
                    text: 'Игра от российских разработчиков, вышла после начала войны, напрямую не про неё, но Всё Понятно. '
                }
            },

        ],
    },
]

const findObjectByName = (array, name) => {
    return array.find((object) => object.name === name);
};

const createCard = (object, categoryName, index) => {
    const ifSubtitle = object.subtitle ? `<p class="text text--base text--grey--dark">${object.subtitle}</p>` : '';
    const ifDesc = object.text ? `<p class="text text--regular text--grey--light popup-card__desc">${object.text}</p>` : '';
    const ifQuoteTitle = object.quote.name ? `<p class="title title--tiny title--black">${object.quote.name}</p>` : '';
    return `
    <div class="popup-card popup-card--${categoryName}" data-id="${index}" data-category="${categoryName}">
        <div class="popup-card__wrapper">
            <div class="popup-card__header">
                <div class="popup-card__img">
                    <img src="assets/images/${categoryName}/${index + 1}-big.jpg" srcset="assets/images/${categoryName}/${index + 1}-big@2x.jpg 2x">
                </div>
            </div>
            <div class="popup-card__content">
                <div class="popup-card__box">
                    <div class="popup-card__info">
                        <p class="title title--small title--grey">
                            ${object.title}
                        </p>
                        ${ifSubtitle}
                    </div>
                    ${ifDesc}
                </div>
                <div class="popup-card__text">
                    ${ifQuoteTitle}
                    <p class="text text--popup text--black">
                        ${object.quote.text}
                    </p>
                </div>
            </div>
        </div>
    </div>
    `
}

const showCardPopup = (cardCategory, cardIndex, popupCardContent) => {
    // found object
    const foundObject = findObjectByName(popupContentObject, cardCategory);
    // check index
    if (cardIndex < 0) cardIndex = 0;
    if (cardIndex > foundObject.items.length - 1) cardIndex = foundObject.items.length - 1;
    // fill card
    const cardContent = createCard(foundObject.items[cardIndex], cardCategory, cardIndex);
    popupCardContent.innerHTML = cardContent;

    //show card
    showPopup('.popup--card');

    // center card
    const elementHeight = popupCardContent.offsetHeight;
    const viewportHeight = popupCardContent.closest('.popup__wrapper').clientHeight;
    console.log(viewportHeight);
    const topMargin = elementHeight  < viewportHeight - 60 ? (viewportHeight - 60 - elementHeight) / 2 : 0;
    popupCardContent.style.marginTop = `${topMargin}px`;
}

const checkTargetOrKey = event => {
    if (
        event.target.classList.contains('popup__wrapper') ||
        event.key === 'Escape' ||
        event.target.closest('.popup-close')
    ) {
        event.preventDefault();
        hideAllPopups();
    }
};
const showPopup = popupId => {
    const popup = document.querySelector(popupId);
    if (!popup) return

    hideAllPopups();

    popup.classList.add('popup--active');
    document.body.classList.add('no-scroll');

    document.addEventListener('click', checkTargetOrKey);
    document.addEventListener('keyup', checkTargetOrKey);
};

const hideAllPopups = () => {
    const popups = document.querySelectorAll('.popup');

    popups.forEach(popup => {
        popup.classList.remove('popup--active');
    });
    document.body.classList.remove('no-scroll');

    document.removeEventListener('click', checkTargetOrKey);
    document.removeEventListener('keyup', checkTargetOrKey);
};


const initTabs = () => {
    const tabs = [...document.querySelectorAll(".tabs")];

    if (tabs.length > 0) {
        tabs.forEach((tab) => {
            const tabContent = [...tab.querySelectorAll(".tabs-content__item")];
            const tabLinks = [...tab.querySelectorAll(".tabs-nav__item:not(.tabs-nav__item--all)")],
                tabAllLink = tab.querySelector('.tabs-nav__item--all');

            const openTab = (tabIndex = 0) => {
                if (tabIndex === 'all') {
                    tabContent.forEach((element, i) => {
                        element.classList.add("tabs-content__item--active");
                    });
                    tabLinks.forEach((element, i) => {
                        element.classList.remove("tabs-nav__item--active");
                    });
                    tabAllLink.classList.add('tabs-nav__item--active');
                } else {
                    tabContent.forEach((element, i) => {
                        const isActive = i === tabIndex;
                        element.classList.toggle("tabs-content__item--active", isActive);
                    });

                    tabLinks.forEach((element, i) => {
                        element.classList.toggle("tabs-nav__item--active", i === tabIndex);
                        tabAllLink.classList.remove('tabs-nav__item--active');
                    });
                }
            }

            openTab('all');

            tabLinks.forEach((link, i) => {
                link.addEventListener("click", (e) => {
                    e.preventDefault();
                    openTab(i);
                });
            });

            tabAllLink.addEventListener('click', (e) => {
                e.preventDefault();

                openTab('all');
            });
        });
    }
}


document.addEventListener("DOMContentLoaded", () => {
    initTabs();

    const expandedArray = document.querySelectorAll('.expanded');

    if (expandedArray.length) {
        expandedArray.forEach(expanded => {
            const expandedLink = expanded.querySelector('.expanded-link'),
                expandedBlock = expanded.querySelector('.expanded-block');

            expanded.style.setProperty('--full-height', `${expandedBlock.clientHeight}px`);

            expandedLink.addEventListener('click', (e) => {
                e.preventDefault();

                expanded.classList.toggle('active');
                expandedBlock.classList.toggle('active');
                expandedLink.classList.toggle('active');
            });
        });
    }

    const cardArray = document.querySelectorAll('.card');

    if (cardArray.length) {
        cardArray.forEach(card => {
            card.addEventListener('click', (e) => {
                e.preventDefault();

                const categoryBlock = card.closest('[data-name]');

                if (categoryBlock) showPopup(`.popup-${categoryBlock.dataset.name}`)
            });
        })
    }

    const cardWrapperArray = document.querySelectorAll('.js-card-wrapper');

    if (cardWrapperArray.length) {
        const popupCardContent = document.querySelector('.js-popup-content');
        if (!popupCardContent) return;


        const popupButtonArray = document.querySelectorAll('.js-popup-button');

        if (popupButtonArray.length) {
            popupButtonArray.forEach(button => {
                button.addEventListener('click', (e) => {
                    e.preventDefault();

                    const popupCard = popupCardContent.querySelector('.popup-card');

                    const currentId = +popupCard.dataset.id;
                    const currentCategory = popupCard.dataset.category;
                    const buttonCount = +button.dataset.number;

                    const nextIndex = currentId + buttonCount;

                    showCardPopup(currentCategory, nextIndex, popupCardContent);
                });
            });
        }
        cardWrapperArray.forEach(cardWrapper => {
            const cardArray = cardWrapper.querySelectorAll('.js-card');
            const cardCategory = cardWrapper.dataset.name;

            if (cardArray.length && cardCategory) {
                cardArray.forEach((cardElement, cardIndex) => {
                    cardElement.addEventListener('click', (e) => {
                        e.preventDefault();

                        showCardPopup(cardCategory, cardIndex, popupCardContent);
                    });
                });
            }
        });
    }
});